Create an empty DataFrame with columns only. Prefixed usually with `df_`

In [4]:
import pandas as pd

df_sales = pd.DataFrame(columns=['Date', 'Amount'])
df_sales

Empty DataFrame
Columns: [Date, Amount]
Index: []

Populate a JSON array object inline into DataFrame

In [5]:
new_data = [
    {'Date': '2021-01-01', 'Amount': 100},
    {'Date': '2021-01-02', 'Amount': 200},
]
df_first_data = pd.DataFrame(new_data)
df_first_data

         Date  Amount
0  2021-01-01     100
1  2021-01-02     200

Combining the 2 DataFrames

In [6]:
df_sales_data = pd.concat([df_sales, df_first_data])
df_sales_data

         Date Amount
0  2021-01-01    100
1  2021-01-02    200

In [7]:
df_new_sales_data = pd.DataFrame([
    {'Date': '2021-01-03', 'Amount': 300},
    {'Date': '2021-01-04', 'Amount': 400}
])
df_new_sales_data

         Date  Amount
0  2021-01-03     300
1  2021-01-04     400

Concat `df_sales_data` with `df_new_sales_data`

In [8]:
df_sales_data = pd.concat([df_sales_data, df_new_sales_data])
df_sales_data

         Date Amount
0  2021-01-01    100
1  2021-01-02    200
0  2021-01-03    300
1  2021-01-04    400

Note that the indexes of the rows are not proper. You need to fix it to see them sequentially ordered.

In [9]:
df_sales_data.reset_index(drop=True, inplace=True)
df_sales_data

         Date Amount
0  2021-01-01    100
1  2021-01-02    200
2  2021-01-03    300
3  2021-01-04    400

In [10]:
additional_columns = [{
    'Location': 'New York',
    'Salesperson': 'John Doe'
}]

In [11]:
df_sales_data = pd.concat([df_sales_data, pd.DataFrame(additional_columns)])
df_sales_data

         Date Amount  Location Salesperson
0  2021-01-01    100       NaN         NaN
1  2021-01-02    200       NaN         NaN
2  2021-01-03    300       NaN         NaN
3  2021-01-04    400       NaN         NaN
0         NaN    NaN  New York    John Doe

Note the importance of not passing the `axis` parameter here. It assumes value `0`. As per mnemonic (This is covered in the Python for Data Science notes) - "*something is happening row-wise*".
Hence the new data which gets concatenated happened on a new row-level.

In [12]:
df_sales_data = df_sales_data.drop(columns=['Location', 'Salesperson'])
df_sales_data.reset_index(drop=True, inplace=True)
df_sales_data

         Date Amount
0  2021-01-01    100
1  2021-01-02    200
2  2021-01-03    300
3  2021-01-04    400
4         NaN    NaN

Now, pass the `axis` parameter as `1` i.e. "*something should happen column-wise*". Hence the concatenation of the data happened at the column level now.

In [13]:
df_sales_data = pd.concat([df_sales_data, pd.DataFrame(additional_columns)], axis=1)
df_sales_data

         Date Amount  Location Salesperson
0  2021-01-01    100  New York    John Doe
1  2021-01-02    200       NaN         NaN
2  2021-01-03    300       NaN         NaN
3  2021-01-04    400       NaN         NaN
4         NaN    NaN       NaN         NaN

In [14]:
additional_data = {
    "Profit": ['10%', '20%'] 
}
df_sales_data = pd.concat([df_sales_data, pd.DataFrame(additional_data)], axis=1)
df_sales_data

         Date Amount  Location Salesperson Profit
0  2021-01-01    100  New York    John Doe    10%
1  2021-01-02    200       NaN         NaN    20%
2  2021-01-03    300       NaN         NaN    NaN
3  2021-01-04    400       NaN         NaN    NaN
4         NaN    NaN       NaN         NaN    NaN